alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F014_FP32_to_UINT32_0_check_0_a.c
/*----------------------------------------------------------------------------
*
* The confidential and proprietary information contained in this file may
* only be used by a person authorised under and to the extent permitted
* by a subsisting licensing agreement from ARM Limited.
*
*        (C) COPYRIGHT 2008-2009 ARM Limited.
*             ALL RIGHTS RESERVED
*             
* This entire notice must be reproduced on all copies of this file
* and copies of this file may only be made by a person if such person is
* permitted to do so under the terms of a subsisting license agreement
* from ARM Limited.
*
* Modified  : $Date: 2013/05/14 11:57:51 $
* Revision  : $Revision: 1.1 $
* Release   : $State: Exp $
*-----------------------------------------------------------------------------*/
#include "m400_gp_F014_FP32_to_UINT32_0_check_0_a.h"
struct t_CheckData_m400_gp_F014_FP32_to_UINT32_0_check_0_a __attribute__ ((section(".mali_data_check"))) CheckData_m400_gp_F014_FP32_to_UINT32_0_check_0_a = {
/* unsigned int data_00002000[] = */
{
 0x00000000,0x00000001,0x00000002,0x00000003 /* 00002000 */
,0x00000004,0x00000005,0x00000006,0x00000007 /* 00002010 */
,0x00000008,0x00000009,0x0000000a,0x0000000b /* 00002020 */
,0x0000000c,0x0000000d,0x0000000e,0x0000000f /* 00002030 */
,0x00000010,0x00000011,0x00000012,0x00000013 /* 00002040 */
,0x00000014,0x00000015,0x00000016,0x00000017 /* 00002050 */
,0x00000018,0x00000019,0x0000001a,0x0000001b /* 00002060 */
,0x0000001c,0x0000001d,0x0000001f,0x00000020 /* 00002070 */
,0xffffffff,0xffffffff,0xffffffff,0xffffff00 /* 00002080 */
,0xfffffe00,0x00000040,0x00000040,0x00000040 /* 00002090 */
,0x00000002,0x00000001,0x00000001,0x00000000 /* 000020a0 */
,0x00000000,0x00000000,0x00000000,0x00000000 /* 000020b0 */
,0x00000000,0x00200000,0x00200000,0x00200001 /* 000020c0 */
,0x00000000,0x00000010,0x00000010,0x00000011 /* 000020d0 */
,0xffffc000,0xffffc100,0xffffc200,0xffffc300 /* 000020e0 */
,0xffffc400,0xffffc500,0xffffc600,0xffffc700 /* 000020f0 */
},
};

